{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "userDefinedMetadata": {"signature": {"inputs": {"input_tensor:0": {"name": "input_tensor:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "48"}, {"size": "8"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "48"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_2/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_2/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "48"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_3/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_3/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_4/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_4/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_5/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_5/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_6/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_6/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_7/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_7/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "9"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_8/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_8/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "10"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "unknown_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "input_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "input_tensor", "StatefulPartitionedCall/spacing_model/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_1/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_2/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_3/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_4/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_5/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_5/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_6/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_6/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_7/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_7/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_8/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/embedding/embedding_lookup", "StatefulPartitionedCall/spacing_model/conv1d_8/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d/conv1d/ExpandDims_1", "unknown_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_1/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_1/conv1d/ExpandDims_1", "unknown_3"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_2/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_2/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_2/conv1d/ExpandDims_1", "unknown_5"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_3/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_3/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_3/conv1d/ExpandDims_1", "unknown_7"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_4/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_4/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_4/conv1d/ExpandDims_1", "unknown_9"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_5/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_5/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_5/conv1d/ExpandDims_1", "unknown_11"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_6/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_6/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_6/conv1d/ExpandDims_1", "unknown_13"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_7/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_7/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_7/conv1d/ExpandDims_1", "unknown_15"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_8/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/spacing_model/conv1d_8/conv1d/ExpandDims", "StatefulPartitionedCall/spacing_model/conv1d_8/conv1d/ExpandDims_1", "unknown_17"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_1/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_2/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_3/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_3/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_4/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_4/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_5/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_5/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_6/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_6/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_7/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_7/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_8/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/conv1d_8/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_7/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/conv1d_8/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/conv1d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_1/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_1/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_2/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_2/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_3/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_3/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_4/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_4/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_5/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_5/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_6/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_6/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_7/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_7/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/spacing_model/conv1d_8/Relu", "StatefulPartitionedCall/spacing_model/max_pooling1d_8/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_1/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_2/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_3/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_4/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_5/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_6/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_7/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_8/ExpandDims", "StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d/transpose"], "attr": {"strides": {"list": {"i": ["1", "8", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "8", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose"], "attr": {"ksize": {"list": {"i": ["1", "8", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "8", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose"], "attr": {"ksize": {"list": {"i": ["1", "8", "1", "1"]}}, "strides": {"list": {"i": ["1", "8", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "16", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "16", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose"], "attr": {"padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "16", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "16", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "16", "1", "1"]}}, "ksize": {"list": {"i": ["1", "16", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose"], "attr": {"strides": {"list": {"i": ["1", "16", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "16", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose"], "attr": {"strides": {"list": {"i": ["1", "16", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "16", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose"], "attr": {"ksize": {"list": {"i": ["1", "16", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "16", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_1/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_2/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_3/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_4/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_5/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_6/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_7/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_8/MaxPool", "StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d/transpose_1"], "attr": {"squeeze_dims": {"list": {"i": ["3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_1/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_2/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_2/transpose_1"], "attr": {"squeeze_dims": {"list": {"i": ["3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_3/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_3/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_4/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_4/transpose_1"], "attr": {"squeeze_dims": {"list": {"i": ["3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_5/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_5/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_6/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_6/transpose_1"], "attr": {"squeeze_dims": {"list": {"i": ["3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_7/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_7/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/max_pooling1d_8/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d_8/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["3"]}}}}, {"name": "StatefulPartitionedCall/spacing_model/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/spacing_model/max_pooling1d/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_1/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_2/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_3/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_4/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_5/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_6/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_7/Squeeze", "StatefulPartitionedCall/spacing_model/max_pooling1d_8/Squeeze", "StatefulPartitionedCall/spacing_model/concat/axis"], "attr": {"N": {"i": "9"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/spacing_model/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/Shape", "StatefulPartitionedCall/spacing_model/dense/Tensordot/axes", "StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/Shape", "StatefulPartitionedCall/spacing_model/dense/Tensordot/free", "StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/spacing_model/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/spacing_model/dense/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/spacing_model/dense/Tensordot/Const_2", "StatefulPartitionedCall/spacing_model/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/Prod", "StatefulPartitionedCall/spacing_model/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/spacing_model/concat", "StatefulPartitionedCall/spacing_model/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/Reshape", "unknown_18"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot/MatMul", "StatefulPartitionedCall/spacing_model/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/spacing_model/dense/Tensordot", "unknown_19"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/spacing_model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/spacing_model/dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Shape", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/free", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Shape", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/axes", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Const_2", "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/spacing_model/dense_1/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/spacing_model/dense_1/Tensordot/GatherV2_1", 